src/InformationRegisters/ЖурналФискальныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЖурналФискальныхОпераций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Устройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОперацииКассовогоУзла</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияТипРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетаДенежнымиСредствами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияВариантОтправкиЭлектронногоЧека</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияКонтактныеДанныеЭлектронногоЧека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияНомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияНомерСменыККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияСуммаОплатыНаличные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияСуммаОплатыПлатежнаяКарта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияСуммаПредоплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФискальнаяОперацияСуммаКредит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМКоррекции</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыОперацииКассовогоУзла.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыОперацииКассовогоУзла</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФискальнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнесениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыемкаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВариантыОтправкиЭлектронногоЧекаПокупателю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыОтправкиЭлектронногоЧекаПокупателю</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОтправлять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьSMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьEmail</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРКО</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймамСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствПодотчетнику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствКассеККМ</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаличнымиВБанк</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/ЖурналФискальныхОпераций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Область "Обновление"

Функция ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ЖурналФискальныхОпераций КАК Журнал
	|	ПО
	|		Журнал.ДокументОснование = ДанныеДокумента.Ссылка
	|ГДЕ
	|	ДанныеДокумента.НомерЧекаККМ <> 0
	|	И Журнал.ДокументОснование ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ЖурналФискальныхОпераций КАК Журнал
	|	ПО
	|		Журнал.ДокументОснование = ДанныеДокумента.Ссылка
	|ГДЕ
	|	ДанныеДокумента.НомерЧекаККМ <> 0
	|	И Журнал.ДокументОснование ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ЖурналФискальныхОпераций КАК Журнал
	|	ПО
	|		Журнал.ДокументОснование = ДанныеДокумента.Ссылка
	|ГДЕ
	|	ДанныеДокумента.НомерЧекаККМ <> 0
	|	И Журнал.ДокументОснование ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.ЧекККМ КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ЖурналФискальныхОпераций КАК Журнал
	|	ПО
	|		Журнал.ДокументОснование = ДанныеДокумента.Ссылка
	|ГДЕ
	|	ДанныеДокумента.НомерЧекаККМ <> 0
	|	И Журнал.ДокументОснование ЕСТЬ NULL
	|";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию() Экспорт
	
	ЗаписиКОбработке = ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию();
	
	Если ЗаписиКОбработке.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
//	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                                     					КАК ДокументОснование,
	|	ДанныеДокумента.Дата                                       					КАК Дата,
	|	ДанныеДокумента.Организация                                				    КАК Организация,
	|	ДанныеДокумента.Касса									   					КАК ТорговыйОбъект,
	|	НЕОПРЕДЕЛЕНО                                               				    КАК Устройство,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОперацииКассовогоУзла.ФискальнаяОперация) 	    КАК ТипОперации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств) КАК ФискальнаяОперацияТипРасчета,
	|   ВЫБОР 
	|       КОГДА ДанныеДокумента.АдресЭП = """" ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.НеОтправлять)
	|		ИНАЧЕ 
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail)
	|	КОНЕЦ 																		КАК ФискальнаяОперацияВариантОтправкиЭлектронногоЧека,
	|	ВЫРАЗИТЬ(ДанныеДокумента.АдресЭП КАК Строка(255)) 							КАК ФискальнаяОперацияКонтактныеДанныеЭлектронногоЧека,
	|	ДанныеДокумента.НомерЧекаККМ                        						КАК ФискальнаяОперацияНомерЧекаККМ,
	|	НЕОПРЕДЕЛЕНО                                               					КАК ФискальнаяОперацияНомерСменыККМ,
	|	ДанныеДокумента.СуммаДокумента                            					КАК ФискальнаяОперацияСумма,
	|	ДанныеДокумента.СуммаДокумента                             					КАК ФискальнаяОперацияСуммаОплатыНаличные,
	|	0 																			КАК ФискальнаяОперацияСуммаОплатыПлатежнаяКарта,
	|	0 																			КАК ФискальнаяОперацияСуммаПредоплаты,
	|	0 																			КАК ФискальнаяОперацияСуммаКредит
	|	
	|ИЗ
	|	&ВТДляОбработкиСсылка КАК СсылкиДляОбработки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер КАК ДанныеДокумента
	|	ПО ДанныеДокумента.Ссылка = СсылкиДляОбработки.ДокументОснование
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                                     КАК ДокументОснование,
	|	ДанныеДокумента.Дата                                       КАК Дата,
	|	ДанныеДокумента.Организация                                КАК Организация,
	|	НЕОПРЕДЕЛЕНО                                               КАК ТорговыйОбъект,
	|	НЕОПРЕДЕЛЕНО                                               КАК Устройство,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОперацииКассовогоУзла.ФискальнаяОперация) КАК ТипОперации,
	|	ВЫБОР ДанныеДокумента.ВидОперации
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ВозвратДенежныхСредствПокупателю) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств)
	|	КОНЕЦ КАК ФискальнаяОперацияТипРасчета,
	|   ВЫБОР 
	|       КОГДА ДанныеДокумента.АдресЭП = """" ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.НеОтправлять)
	|		ИНАЧЕ 
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail)
	|	КОНЕЦ 																		КАК ФискальнаяОперацияВариантОтправкиЭлектронногоЧека,
	|	ВЫРАЗИТЬ(ДанныеДокумента.АдресЭП КАК Строка(255)) 							КАК ФискальнаяОперацияКонтактныеДанныеЭлектронногоЧека,
	|	ДанныеДокумента.НомерЧекаККМ                        						КАК ФискальнаяОперацияНомерЧекаККМ,
	|	НЕОПРЕДЕЛЕНО                                               					КАК ФискальнаяОперацияНомерСменыККМ,
	|	ДанныеДокумента.СуммаДокумента                             					КАК ФискальнаяОперацияСумма,
	|	0 КАК ФискальнаяОперацияСуммаОплатыНаличные,
	|	ДанныеДокумента.СуммаДокумента                             					КАК ФискальнаяОперацияСуммаОплатыПлатежнаяКарта,
	|	0 КАК ФискальнаяОперацияСуммаПредоплаты,
	|	0 КАК ФискальнаяОперацияСуммаКредит
	|	
	|ИЗ
	|	&ВТДляОбработкиСсылка КАК СсылкиДляОбработки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОплатаОтПокупателяПлатежнойКартой КАК ДанныеДокумента
	|	ПО ДанныеДокумента.Ссылка = СсылкиДляОбработки.ДокументОснование
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                                     КАК ДокументОснование,
	|	ДанныеДокумента.Дата                                       КАК Дата,
	|	ДанныеДокумента.Организация                                КАК Организация,
	|	ВЫБОР ДанныеДокумента.ВидОперации
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВыдачаДенежныхСредствКассеККМ) ТОГДА
	|			ДанныеДокумента.ККМ
	|		ИНАЧЕ
	|			ДанныеДокумента.Касса
	|	КОНЕЦ КАК ТорговыйОбъект,
	|	НЕОПРЕДЕЛЕНО                                               КАК Устройство,
	|	ВЫБОР ДанныеДокумента.ВидОперации
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВыдачаДенежныхСредствКассеККМ) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ТипыОперацииКассовогоУзла.ВнесениеДенежныхСредств)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ТипыОперацииКассовогоУзла.ФискальнаяОперация)
	|	КОНЕЦ КАК ТипОперации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств) КАК ФискальнаяОперацияТипРасчета,
	|   ВЫБОР 
	|       КОГДА ДанныеДокумента.АдресЭП = """" ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.НеОтправлять)
	|		ИНАЧЕ 
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail)
	|	КОНЕЦ 																		КАК ФискальнаяОперацияВариантОтправкиЭлектронногоЧека,
	|	ВЫРАЗИТЬ(ДанныеДокумента.АдресЭП КАК Строка(255)) 							КАК ФискальнаяОперацияКонтактныеДанныеЭлектронногоЧека,
	|	ДанныеДокумента.НомерЧекаККМ                        						КАК ФискальнаяОперацияНомерЧекаККМ,
	|	НЕОПРЕДЕЛЕНО                                               КАК ФискальнаяОперацияНомерСменыККМ,
	|	ДанныеДокумента.СуммаДокумента                             КАК ФискальнаяОперацияСумма,
	|	ДанныеДокумента.СуммаДокумента                             КАК ФискальнаяОперацияСуммаОплатыНаличные,
	|	0 КАК ФискальнаяОперацияСуммаОплатыПлатежнаяКарта,
	|	0 КАК ФискальнаяОперацияСуммаПредоплаты,
	|	0 КАК ФискальнаяОперацияСуммаКредит
	|	
	|ИЗ
	|	&ВТДляОбработкиСсылка КАК СсылкиДляОбработки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер КАК ДанныеДокумента
	|	ПО ДанныеДокумента.Ссылка = СсылкиДляОбработки.ДокументОснование
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                                     КАК ДокументОснование,
	|	ДанныеДокумента.Дата                                       КАК Дата,
	|	ДанныеДокумента.Организация                                КАК Организация,
	|	ДанныеДокумента.КассаККМ                                   КАК ТорговыйОбъект,
	|	НЕОПРЕДЕЛЕНО                                               КАК Устройство,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыОперацииКассовогоУзла.ФискальнаяОперация)         КАК ТипОперации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств) КАК ФискальнаяОперацияТипРасчета,
	|   ВЫБОР 
	|       КОГДА ДанныеДокумента.АдресЭП = """" ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.НеОтправлять)
	|		ИНАЧЕ 
	|			ЗНАЧЕНИЕ(Перечисление.ВариантыОтправкиЭлектронногоЧекаПокупателю.ОтправитьEmail)
	|	КОНЕЦ 																		КАК ФискальнаяОперацияВариантОтправкиЭлектронногоЧека,
	|	ВЫРАЗИТЬ(ДанныеДокумента.АдресЭП КАК Строка(255)) 							КАК ФискальнаяОперацияКонтактныеДанныеЭлектронногоЧека,
	|	ДанныеДокумента.НомерЧекаККМ                        КАК ФискальнаяОперацияНомерЧекаККМ,
	|	НЕОПРЕДЕЛЕНО                                               КАК ФискальнаяОперацияНомерСменыККМ,
	|	ДанныеДокумента.СуммаДокумента                             КАК ФискальнаяОперацияСумма,
	|	ДанныеДокумента.СуммаДокумента - ЕСТЬNULL(СУММА(ПлатежныеКарты.Сумма), 0)   КАК ФискальнаяОперацияСуммаОплатыНаличные,
	|	ЕСТЬNULL(СУММА(ПлатежныеКарты.Сумма), 0)                   КАК ФискальнаяОперацияСуммаОплатыПлатежнаяКарта,
	|	0									                       КАК ФискальнаяОперацияСуммаПредоплаты,
	|	0 КАК ФискальнаяОперацияСуммаКредит
	|	
	|ИЗ
	|	&ВТДляОбработкиСсылка КАК СсылкиДляОбработки
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ КАК ДанныеДокумента
	|	ПО ДанныеДокумента.Ссылка = СсылкиДляОбработки.ДокументОснование
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Оплата КАК ПлатежныеКарты
	|	ПО ПлатежныеКарты.Ссылка = ДанныеДокумента.Ссылка
	|   И (ПлатежныеКарты.ВидОплаты.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта))
	|	
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Ссылка
	|";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВТДляОбработкиСсылка", ЗаписиКОбработке);
	
	ТаблицыДляЧтения = Новый Массив;
	ТаблицыДляЧтения.Добавить("Документ.ПриходныйКассовыйОрдер");
	ТаблицыДляЧтения.Добавить("Документ.РасходныйКассовыйОрдер");
	ТаблицыДляЧтения.Добавить("Документ.ОплатаОтПокупателяПлатежнойКартой");
	ТаблицыДляЧтения.Добавить("Документ.ЧекККМ");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			НаборЗаписей = РегистрыСведений.ЖурналФискальныхОпераций.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДокументОснование.Установить(Выборка.ДокументОснование);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.ИдентификаторЗаписи = Строка(Новый УникальныйИдентификатор());;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Конец области "Обновление"

#КонецЕсли
